console.log("𠮷野家"[0]);
console.log("𠮷野家"[0] + "𠮷野家"[1]);
console.log("👨‍👨‍👧‍👧"[0]);
console.log("👨‍👨‍👧‍👧".length); // 11
console.log(
  "👨‍👨‍👧‍👧"[0] +
    "👨‍👨‍👧‍👧"[1] +
    "👨‍👨‍👧‍👧"[2] +
    "👨‍👨‍👧‍👧"[3] +
    "👨‍👨‍👧‍👧"[4] +
    "👨‍👨‍👧‍👧"[5] +
    "👨‍👨‍👧‍👧"[6] +
    "👨‍👨‍👧‍👧"[7] +
    "👨‍👨‍👧‍👧"[8] +
    "👨‍👨‍👧‍👧"[9] +
    "👨‍👨‍👧‍👧"[10],
);
console.log("👨‍👨‍👧‍👧"[0] + "👨‍👨‍👧‍👧"[1]); // 大人の男
console.log("👨‍👨‍👧‍👧"[3] + "👨‍👨‍👧‍👧"[4]); // 大人の男
console.log("👨‍👨‍👧‍👧"[6] + "👨‍👨‍👧‍👧"[7]); // 子どもの女
console.log("👨‍👨‍👧‍👧"[9] + "👨‍👨‍👧‍👧"[10]); // 子どもの女

// 実行結果
// �
// �
// �は特殊用途文字
// 𠮷は漢字一文字で2バイト使用するため、1バイト分の文字を表示することができない
// 👨‍👨‍👧‍👧の絵文字は、家族一人当たり2バイトで表現し4人いるため８バイト、
